---

## Relational vs Transactional Model


**Relational Model:**  
- Organizes data into **tables (relations)** with rows and columns.
- Each table has a schema with **defined data types** and **constraints** (like primary keys).
- Tables can be related via **foreign keys**.
- Supports **declarative querying** using SQL.

**Transactional Model (ACID):**  
Focuses on maintaining **data integrity** during database operations:
- **A**tomicity: Each transaction is all-or-nothing.
- **C**onsistency: Database moves from one valid state to another.
- **I**solation: Concurrent transactions don't interfere with each other.
- **D**urability: Once committed, changes are permanent, even if the system crashes.

These models often **work together**: relational databases (like PostgreSQL or MySQL) enforce ACID properties through transactions.

---

## Entity-Relationship (ER) Diagrams


Entity-Relationship (ER) diagrams are **visual representations** of the data model and how different entities relate to each other in a relational database.

They help with designing and understanding databases before actually implementing them in SQL.

### Key Components:

- **Entities:**  
  Represent real-world objects or concepts (e.g., `Student`, `Course`).  
  In the database, each entity becomes a **table**.

- **Attributes:**  
  Properties that describe an entity (e.g., `name`, `email`, `age` for a `Student`).  
  Each attribute becomes a **column** in a table.

- **Primary Key (PK):**  
  A unique identifier for each record in a table. Every table should have one.

- **Foreign Key (FK):**  
  An attribute in one table that refers to the **primary key** in another. It’s how tables relate to one another.

- **Relationships:**  
  Define how entities are connected. They can be:
  - **One-to-One (1:1):** One row in Table A maps to one row in Table B.
  - **One-to-Many (1:N):** One row in Table A maps to many rows in Table B.
  - **Many-to-Many (M:N):** Many rows in Table A map to many in Table B (usually implemented via a **junction table**).

### Example ER Diagram (Text Form)

In [ ]:

[Student]
- student_id (PK)
- name
- email

[Course]
- course_id (PK)
- title
- instructor

[Enrollment]
- student_id (FK)
- course_id (FK)
- enrollment_date


This creates a **many-to-many** relationship between `Student` and `Course`.

ER diagrams are used during the **database design phase**, helping you understand relationships before writing any SQL.

---

## CREATE TABLE


The `CREATE TABLE` statement is used to define a new table in the database. You specify:
- The table name
- Each column's name and data type
- Any constraints like primary keys, uniqueness, or not-null requirements

### Syntax

In [ ]:

CREATE TABLE table_name (
    column1 data_type constraint,
    column2 data_type constraint,
    ...
);


### Common Data Types
- `INT`, `INTEGER`: Whole numbers
- `FLOAT`, `DECIMAL`: Numbers with decimals (use `DECIMAL(p, s)` for precision)
- `VARCHAR(n)`: Variable-length string (up to `n` characters)
- `CHAR(n)`: Fixed-length string
- `TEXT`: Large string/text
- `DATE`: Calendar date
- `TIMESTAMP`: Date + time
- `BOOLEAN`: True/False values


### Common Constraints
- `PRIMARY KEY`: Uniquely identifies each row; cannot be NULL
- `NOT NULL`: Value must be provided
- `UNIQUE`: All values in this column must be distinct
- `DEFAULT`: Sets a default value
- `CHECK`: Validates that values meet a condition
- `AUTO_INCREMENT`: Automatically increases value for each new row (MySQL)

You can also define **foreign keys** (covered in the ER diagrams section) that link to another table.

### Example: Creating a Student Table

In [ ]:

CREATE TABLE Student (
    student_id INT PRIMARY KEY,
    names VARCHAR(100) NOT NULL,
    email VARCHAR(100) UNIQUE,
    birthdate DATE,
    is_active BOOLEAN DEFAULT TRUE
);


This creates a table named `Student` with:
- A unique, non-null `student_id` as the primary key
- A required `name` field
- An `email` that must be unique if provided
- A date of birth field
- A boolean field that defaults to `TRUE`

### Notes


- Always choose the most appropriate data type; don’t overuse `TEXT` or `VARCHAR(255)` without reason  
- Add `NOT NULL` to all fields that are required by your business logic  
- When using `AUTO_INCREMENT` (MySQL) or `SERIAL` (PostgreSQL), you don’t need to insert values manually

---

## ALTER TABLE and DROP TABLE


The `ALTER TABLE` statement allows you to **modify the structure** of an existing table after it has been created.

This is commonly used to:
- Add or drop a column
- Add or drop a constraint (e.g., primary key or unique constraint)
- Rename a column (SQL dialect-specific)

### Syntax: Adding and Dropping Columns

In [ ]:

-- Add a new column
ALTER TABLE table_name
ADD column_name data_type constraint;

-- Drop a column
ALTER TABLE table_name
DROP COLUMN column_name;

### Syntax: Adding Constraints

In [ ]:

-- Add a new constraint
ALTER TABLE table_name
ADD CONSTRAINT constraint_name constraint_type (column_name);

-- Example: Add a UNIQUE constraint
ALTER TABLE Student
ADD CONSTRAINT unique_email UNIQUE (email);

### Syntax: Dropping Constraints

In [ ]:

-- Drop a constraint (syntax varies slightly by SQL dialect)
ALTER TABLE table_name
DROP CONSTRAINT constraint_name;

-- In MySQL, use DROP INDEX for UNIQUE
ALTER TABLE table_name
DROP INDEX index_name;

### Notes


- Be **very careful** when dropping columns or constraints — data may be lost or application logic broken.
- Some databases (like SQLite) do **not support dropping columns** directly; workarounds involve recreating the table.
- Naming your constraints when creating the table makes them easier to alter or remove later.

### DROP TABLE


The `DROP TABLE` statement permanently **removes a table and all of its data** from the database.

### Syntax

In [ ]:

DROP TABLE table_name;


This action is **irreversible** — once a table is dropped, its data and structure are gone unless you have a backup.

Some dialects support conditional drops:

In [ ]:

-- Drop only if it exists
DROP TABLE IF EXISTS table_name;

---

## INSERT INTO, UPDATE, and DELETE


These are the core operations used to manipulate data inside an existing table:

- `INSERT INTO`: Add new rows to a table
- `UPDATE`: Modify values in existing rows
- `DELETE`: Remove rows from a table

These operations are part of the **Data Manipulation Language (DML)** in SQL.

### INSERT INTO

In [ ]:

-- Insert a single row (specify columns)
INSERT INTO Student (student_id, name, email, birthdate)
VALUES (1, 'Alice', 'alice@example.com', '2000-01-01');

-- Insert multiple rows
INSERT INTO Student (student_id, name, email, birthdate)
VALUES 
  (2, 'Bob', 'bob@example.com', '2001-03-14'),
  (3, 'Charlie', 'charlie@example.com', '1999-07-22');


- Always specify the columns explicitly — especially if the table schema may change.
- You can omit a column if it has a `DEFAULT` value or allows `NULL`.

### UPDATE

In [ ]:

-- Update a single record
UPDATE Student
SET email = 'alice_new@example.com'
WHERE student_id = 1;

-- Update multiple records with a condition
UPDATE Student
SET is_active = FALSE
WHERE birthdate < '2000-01-01';


- The `WHERE` clause is **critical** — without it, all rows will be updated.
- You can update one or many columns at once.

### DELETE

In [ ]:

-- Delete a single row
DELETE FROM Student
WHERE student_id = 3;

-- Delete multiple rows matching a condition
DELETE FROM Student
WHERE is_active = FALSE;


- Again, the `WHERE` clause is essential.  
  Omitting it will delete **all rows in the table**.
- If you're unsure, do a `SELECT` with the same `WHERE` first to preview the affected rows.

---

## SELECT and Basic Filtering with WHERE


The `SELECT` statement is used to retrieve data from one or more tables. You can return all columns or specify which ones you want.

### Syntax

In [ ]:

-- Select all columns
SELECT * FROM table_name;

-- Select specific columns
SELECT column1, column2 FROM table_name;


The `WHERE` clause is used to filter rows based on a condition. Only rows that satisfy the condition will be returned.

### Basic Comparison Operators

In [ ]:

=    -- Equal
!=   -- Not equal (can also use <>)
>    -- Greater than
<    -- Less than
>=   -- Greater than or equal to
<=   -- Less than or equal to

### Example: Select students born after the year 2000

In [ ]:

SELECT name, birthdate
FROM Student
WHERE birthdate > '2000-01-01';


### Logical Operators
You can combine conditions using:
- `AND`: Both conditions must be true
- `OR`: At least one condition must be true
- `NOT`: Negates the condition

### Example: Select active students born after 2000

In [ ]:

SELECT name
FROM Student
WHERE is_active = TRUE AND birthdate > '2000-01-01';


- Always use parentheses if you're combining multiple `AND` and `OR` conditions to avoid logic errors.

---

## Advanced Filtering: IN, NOT IN, BETWEEN, IS NULL


Advanced filtering allows you to write more expressive and flexible `WHERE` conditions.

These tools are often used in real-world queries and are critical for interviews.

### IN and NOT IN

In [ ]:

-- Select students from a specific list of names
SELECT name
FROM Student
WHERE name IN ('Alice', 'Bob');

-- Exclude students in a given list
SELECT name
FROM Student
WHERE name NOT IN ('Charlie', 'Dave');


Use `IN` and `NOT IN` to test whether a value belongs to a **set of discrete options**.  
This is cleaner and more efficient than using multiple `OR` or `AND` conditions.

### BETWEEN

In [ ]:

-- Select students born between two dates (inclusive)
SELECT name, birthdate
FROM Student
WHERE birthdate BETWEEN '2000-01-01' AND '2001-12-31';


`BETWEEN` is inclusive — both boundary values are included.
It works with numeric, date, or time values.

### IS NULL and IS NOT NULL

In [ ]:

-- Find students with no email address
SELECT name
FROM Student
WHERE email IS NULL;

-- Find students who have provided an email
SELECT name
FROM Student
WHERE email IS NOT NULL;


In SQL, `NULL` represents the absence of a value. You cannot use `=` or `!=` with `NULL` — always use `IS NULL` or `IS NOT NULL`.

---

## Wildcards and Pattern Matching with LIKE


SQL supports **pattern matching** using the `LIKE` operator, which is commonly used in `WHERE` clauses to filter text columns.

`LIKE` works with two special wildcard characters:
- `%`: Matches **zero or more** characters
- `_`: Matches **exactly one** character

### Syntax

In [ ]:

-- Find names starting with 'A'
SELECT name
FROM Student
WHERE name LIKE 'A%';

-- Find names ending with 'e'
SELECT name
FROM Student
WHERE name LIKE '%e';

-- Find names containing 'li'
SELECT name
FROM Student
WHERE name LIKE '%li%';

-- Find names with exactly 4 letters
SELECT name
FROM Student
WHERE name LIKE '____';


### Notes
- Pattern matching is **case-insensitive** in some SQL dialects (e.g., MySQL), but **case-sensitive** in others (e.g., PostgreSQL unless using `ILIKE`)
- Use `ESCAPE` if you need to search for literal `%` or `_` characters

---

## ORDER BY – Sorting Results


The `ORDER BY` clause allows you to **sort query results** by one or more columns.

By default, SQL sorts in **ascending (ASC)** order. You can also specify **descending (DESC)**.

### Syntax

In [ ]:

-- Sort by one column ascending
SELECT name, birthdate
FROM Student
ORDER BY birthdate;

-- Sort by one column descending
SELECT name, birthdate
FROM Student
ORDER BY birthdate DESC;

-- Sort by multiple columns
SELECT name, birthdate, email
FROM Student
ORDER BY birthdate ASC, name DESC;


You can also sort by:
- **Column alias** (defined in the SELECT clause)
- **Ordinal position** (the position of the column in the SELECT list)

### Example: Sort using column alias

In [ ]:

SELECT name, LENGTH(name) AS name_length
FROM Student
ORDER BY name_length DESC;


### Notes
- Always place `ORDER BY` **at the end** of your query (after `WHERE`, `GROUP BY`, etc.)
- When sorting by a column that can contain `NULL`, the position of nulls may vary by SQL dialect:
  - Some treat `NULL` as **lowest**
  - Some allow `NULLS FIRST` or `NULLS LAST` to control order

---

## Math Operations in SQL


SQL supports arithmetic operations directly in queries. These can be used in the `SELECT` clause, `WHERE` clause, or `ORDER BY` clause.

### Supported Operators
- `+` : Addition
- `-` : Subtraction
- `*` : Multiplication
- `/` : Division
- `%` : Modulus (remainder; may not be supported in all databases)

These operations work on numeric data types like `INT`, `FLOAT`, and `DECIMAL`.

### Example: Add a calculated column to output

In [ ]:

-- Assume we have a table with students and their scores
SELECT name, score, score + 5 AS bonus_score
FROM ExamResults;

### Example: Use math in filtering

In [ ]:

-- Find students who scored more than 90 after adding 5 bonus points
SELECT name, score
FROM ExamResults
WHERE score + 5 > 90;


### Notes
- Most databases perform **integer division** if both operands are integers (e.g., `5 / 2 = 2`)
- To force floating-point division, use a decimal literal: `5 / 2.0`
- Be careful with division by zero — it will raise an error

---

## Aggregate Functions


Aggregate functions operate on **sets of rows** and return a single value. They are commonly used in reporting, analytics, and in combination with `GROUP BY`.

### Common Aggregate Functions
- `COUNT(*)`: Total number of rows
- `COUNT(column)`: Number of non-null values in a column
- `SUM(column)`: Total sum of a numeric column
- `AVG(column)`: Average of a numeric column
- `MIN(column)`: Smallest value in a column
- `MAX(column)`: Largest value in a column

### Examples

In [ ]:

-- Count the number of students
SELECT COUNT(*) AS total_students
FROM Student;

-- Count how many students have provided an email
SELECT COUNT(email) AS students_with_email
FROM Student;

-- Find the average score
SELECT AVG(score) AS average_score
FROM ExamResults;

-- Get the highest and lowest scores
SELECT MAX(score) AS top_score, MIN(score) AS lowest_score
FROM ExamResults;


### Notes
- Aggregate functions **ignore NULL values** (except `COUNT(*)`)
- You can use them **without GROUP BY** to summarize the entire table
- Use **aliases** (e.g., `AS total_students`) to make output clearer

---

## GROUP BY and HAVING


The `GROUP BY` clause groups rows that have the same values in specified columns. It is typically used with **aggregate functions** to summarize data.

The `HAVING` clause is used to filter **grouped results**, similar to how `WHERE` filters individual rows.

### Syntax

In [ ]:

SELECT column1, AGG_FUNC(column2)
FROM table_name
GROUP BY column1
HAVING condition;

### Example: Count students by activity status

In [ ]:

SELECT is_active, COUNT(*) AS count
FROM Student
GROUP BY is_active;

### Example: Average score by exam and filter with HAVING

In [ ]:

SELECT exam_id, AVG(score) AS avg_score
FROM ExamResults
GROUP BY exam_id
HAVING AVG(score) > 80;


### Notes
- All columns in the `SELECT` clause must be **aggregated** or **included in the GROUP BY**
- `HAVING` must be used for conditions on **aggregated values**, while `WHERE` is used for filtering **before grouping**
- `GROUP BY` can be used with multiple columns

### Example: Group by multiple columns

In [ ]:

SELECT exam_id, is_passed, COUNT(*) AS count
FROM ExamResults
GROUP BY exam_id, is_passed;

---

## CASE – Conditional Logic in SQL


The `CASE` statement allows you to return values **based on conditions**, similar to `if-else` logic in programming.

It's often used inside the `SELECT`, `ORDER BY`, or even `WHERE` clauses to apply conditional transformations.

### Syntax

In [ ]:

CASE 
    WHEN condition1 THEN result1
    WHEN condition2 THEN result2
    ...
    ELSE default_result
END

### Example: Categorize scores into grade bands

In [ ]:

SELECT student_id, score,
  CASE 
    WHEN score >= 85 THEN 'High Distinction'
    WHEN score >= 75 THEN 'Distinction'
    WHEN score >= 65 THEN 'Credit'
    WHEN score >= 50 THEN 'Pass'
    ELSE 'Fail'
  END AS grade
FROM ExamResults;


### Notes
- The `CASE` expression is evaluated **top-down**, and stops at the **first condition that is true**
- You can use `CASE` in `SELECT`, `WHERE`, `ORDER BY`, `GROUP BY`, and even inside aggregate functions
- The `ELSE` clause is optional, but good practice to include

---

## Subqueries


A **subquery** is a query nested inside another query. It is used to:
- Provide values for filtering (`WHERE`)
- Act as a derived table (`FROM`)
- Generate values (`SELECT`)

Subqueries are enclosed in parentheses `()` and can return a **single value**, **a column**, or even an entire table.

They are often used when a query needs intermediate results before applying the final logic.

### Subquery in WHERE clause

In [ ]:

-- Select students with scores above the average
SELECT student_id, score
FROM ExamResults
WHERE score > (
    SELECT AVG(score) FROM ExamResults
);

### Subquery in SELECT clause

In [ ]:

-- Select student names and total number of students (same number for every row)
SELECT name,
  (SELECT COUNT(*) FROM Student) AS total_students
FROM Student;

### Subquery in FROM clause (Derived Table)

In [ ]:

-- Calculate average score per student, then filter those above 85
SELECT student_id, avg_score
FROM (
    SELECT student_id, AVG(score) AS avg_score
    FROM ExamResults
    GROUP BY student_id
) AS student_averages
WHERE avg_score > 85;


### Notes
- Subqueries in `WHERE` and `SELECT` must return **a single value** (scalar) unless used with `IN` or comparison operators
- Subqueries in `FROM` must be given an **alias**
- Be careful with performance — nested subqueries may be expensive

---

## Joins


A **join** is used to combine rows from two or more tables based on a related column between them.

To perform a join, you must:
1. Know the **relationship** between tables (typically via primary key and foreign key)
2. Specify **join condition(s)** using `ON` or `USING`

There are several types of joins, each with different behavior depending on matching rows.

### INNER JOIN

In [ ]:

-- Return students and their exam scores (only if they have scores)
SELECT s.name, e.exam_id, e.score
FROM Student s
INNER JOIN ExamResults e ON s.student_id = e.student_id;


Returns only rows where there is a match in **both** tables.

### LEFT JOIN (or LEFT OUTER JOIN)

In [ ]:

-- Return all students, even if they haven't taken an exam
SELECT s.name, e.exam_id, e.score
FROM Student s
LEFT JOIN ExamResults e ON s.student_id = e.student_id;


Returns all rows from the **left** table, and matching rows from the right.  
If there's no match, the right side columns will be `NULL`.

### RIGHT JOIN (or RIGHT OUTER JOIN)

In [ ]:

-- Return all exam records, even if student details are missing
SELECT s.name, e.exam_id, e.score
FROM Student s
RIGHT JOIN ExamResults e ON s.student_id = e.student_id;


Returns all rows from the **right** table, and matching rows from the left.  
Less common than `LEFT JOIN`, and not supported in all dialects (e.g., SQLite).

### FULL OUTER JOIN

In [ ]:

-- Return all students and all exam records, regardless of match
SELECT s.name, e.exam_id, e.score
FROM Student s
FULL OUTER JOIN ExamResults e ON s.student_id = e.student_id;


Returns all rows from **both** tables. Non-matching rows have `NULL` in missing fields.  
Not supported in all SQL dialects (e.g., MySQL needs `UNION` workaround).

### SELF JOIN

In [ ]:

-- Example: Find pairs of students with the same birthdate
SELECT A.name AS student1, B.name AS student2, A.birthdate
FROM Student A
JOIN Student B ON A.birthdate = B.birthdate
WHERE A.student_id < B.student_id;


A self join is a regular join, but the **same table is joined to itself**.  
Use aliases to distinguish between the two instances.

### CROSS JOIN

In [ ]:

-- Pair every student with every exam (Cartesian product)
SELECT s.name, e.exam_id
FROM Student s
CROSS JOIN Exam e;


Returns the **Cartesian product** of both tables (every row from A with every row from B).  
Use with care — can return a very large number of rows.

---

## Aliases


**Aliases** allow you to assign temporary names to columns or tables in a query.  
They help improve **readability**, avoid naming conflicts, and are required in some cases (like subqueries or self-joins).

Aliases do not change the actual table or column names in the database — they exist only for the duration of the query.

### Column Aliases

In [ ]:

-- Rename a column in the output
SELECT name AS student_name, birthdate AS dob
FROM Student;


You can also use aliases without the `AS` keyword (though using `AS` is clearer and preferred):

In [ ]:

SELECT name student_name, birthdate dob
FROM Student;

### Table Aliases

In [ ]:

-- Use short names for tables to simplify joins
SELECT s.name, e.exam_id
FROM Student AS s
JOIN ExamResults AS e ON s.student_id = e.student_id;


Table aliases are especially useful in:
- Joins involving multiple tables
- Self-joins (same table referenced more than once)
- Long or complex table names

### Notes
- Aliases can be used in `SELECT`, `FROM`, `WHERE`, `ORDER BY`, and subqueries
- Always use table aliases in joins to make your queries easier to read
- Avoid reusing the same alias for multiple things in a single query

---

## Set Operations: UNION, UNION ALL, INTERSECT, EXCEPT


Set operations are used to **combine the results of two or more `SELECT` queries** into a single result set.

Each query involved in a set operation must:
- Return the **same number of columns**
- Have **compatible data types** in corresponding columns

### UNION

In [ ]:

-- Combine results and remove duplicates
SELECT name FROM Students_A
UNION
SELECT name FROM Students_B;


- Combines rows from both queries
- Removes **duplicate rows** from the final result

### UNION ALL

In [ ]:

-- Combine results and keep duplicates
SELECT name FROM Students_A
UNION ALL
SELECT name FROM Students_B;


- Combines rows from both queries
- **Keeps all duplicates**
- Faster than `UNION` since no duplicate check is needed

### INTERSECT

In [ ]:

-- Get only names that appear in both tables
SELECT name FROM Students_A
INTERSECT
SELECT name FROM Students_B;


- Returns only rows that exist in **both** result sets
- Not supported in all databases (e.g., not in MySQL without workarounds)

### EXCEPT (or MINUS)

In [ ]:

-- Return names in Students_A but not in Students_B
SELECT name FROM Students_A
EXCEPT
SELECT name FROM Students_B;


- Returns rows from the first query **that do not exist** in the second
- `EXCEPT` is standard SQL; some databases like Oracle use `MINUS`

### Notes


- Use parentheses `()` if you're combining set operations with other clauses (e.g., `ORDER BY`)
- You can chain multiple set operations:  
  `(SELECT ...) UNION (SELECT ...) INTERSECT (SELECT ...)`
- Always double-check column names and data types to avoid silent mismatches

---

## String Manipulation


SQL provides a variety of functions for processing and transforming string data. These are useful for formatting, extracting, or cleaning values.

Common functions include: `CONCAT`, `SUBSTRING`, `UPPER`, `LOWER`, `TRIM`, `REPLACE`, and `LENGTH`.

### CONCAT

In [ ]:

-- Combine first and last names into a full name
SELECT CONCAT(first_name, ' ', last_name) AS full_name
FROM Student;

Some SQL dialects (like PostgreSQL) support this alternate syntax:

In [ ]:

SELECT first_name || ' ' || last_name AS full_name
FROM Student;

### SUBSTRING (or SUBSTR)

In [ ]:

-- Extract first 3 letters of a name
SELECT SUBSTRING(name FROM 1 FOR 3) AS short_name
FROM Student;

-- Alternate syntax (used in some databases)
SELECT SUBSTR(name, 1, 3) AS short_name
FROM Student;

### UPPER and LOWER

In [ ]:

-- Convert names to uppercase or lowercase
SELECT UPPER(name) AS name_upper, LOWER(name) AS name_lower
FROM Student;

### TRIM, LTRIM, RTRIM

In [ ]:

-- Remove whitespace from both ends of a string
SELECT TRIM('   Alice   ') AS trimmed;

-- Remove leading and trailing spaces
SELECT LTRIM('   Alice') AS left_trimmed;
SELECT RTRIM('Alice   ') AS right_trimmed;

### LENGTH (or LEN)

In [ ]:

-- Get the number of characters in a string
SELECT name, LENGTH(name) AS name_length
FROM Student;

### REPLACE

In [ ]:

-- Replace part of a string
SELECT REPLACE(name, 'a', '*') AS censored_name
FROM Student;

### Notes


- Function names and syntax may vary slightly depending on SQL dialect  
- Most string functions return `NULL` if input is `NULL`  
- Always test with edge cases like empty strings or NULLs

---

## Date and Time Functions


SQL includes built-in functions to manipulate and query `DATE`, `TIME`, and `TIMESTAMP` values.  
These functions vary slightly between SQL dialects, but the core functionality is similar.

### NOW() / CURRENT_DATE / CURRENT_TIMESTAMP

In [ ]:

-- Get current date and time
SELECT NOW();                 -- Date + Time
SELECT CURRENT_DATE;          -- Date only
SELECT CURRENT_TIMESTAMP;     -- Same as NOW() in many systems

### DATE_ADD and DATE_SUB

In [ ]:

-- Add or subtract intervals (MySQL syntax)
SELECT DATE_ADD('2024-01-01', INTERVAL 10 DAY);
SELECT DATE_SUB('2024-01-01', INTERVAL 1 MONTH);

### DATEDIFF

In [ ]:

-- Get number of days between two dates (MySQL / SQL Server)
SELECT DATEDIFF('2024-03-01', '2024-01-01');   -- Returns 60

### EXTRACT (or DATE_PART)

In [ ]:

-- Extract parts of a date (year, month, etc.)
SELECT EXTRACT(YEAR FROM birthdate) AS birth_year
FROM Student;

-- PostgreSQL alternate: DATE_PART
SELECT DATE_PART('month', birthdate) AS birth_month
FROM Student;

### TO_CHAR / FORMAT / STRFTIME

In [ ]:

-- Format a date (PostgreSQL / Oracle)
SELECT TO_CHAR(NOW(), 'YYYY-MM-DD');

-- SQL Server equivalent
SELECT FORMAT(GETDATE(), 'yyyy-MM-dd');

-- SQLite example
SELECT STRFTIME('%Y-%m-%d', 'now');

### Notes


- Date functions vary more than most other SQL functions — always check syntax for your SQL engine  
- Timestamps include both date and time, but can often be cast or truncated to date  
- Always ensure consistent **time zones** if working across servers or locations

---

## CAST – Data Type Conversion


The `CAST()` function is used to explicitly convert a value from one data type to another.

It is often used when:
- Comparing values of different types (e.g., `INT` vs `VARCHAR`)
- Formatting numeric or date values
- Ensuring type compatibility in joins or calculations

### Syntax

In [ ]:

CAST(expression AS target_data_type)

### Example: Convert integer to string

In [ ]:

SELECT CAST(123 AS VARCHAR) AS string_value;

### Example: Convert date to string

In [ ]:

SELECT CAST(CURRENT_DATE AS VARCHAR) AS date_text;

### Example: Convert string to integer

In [ ]:

SELECT CAST('42' AS INT) AS int_value;


You can also use `::` shorthand in some dialects (like PostgreSQL):

In [ ]:

SELECT '2024-01-01'::DATE;

### Notes


- Always use `CAST()` when implicit conversion is unreliable or ambiguous  
- Invalid conversions (e.g., casting 'abc' to INT) will raise errors  
- SQL Server also supports `CONVERT()`, but `CAST()` is ANSI-standard and more portable  
- In many cases, casting is required when using functions like `GROUP BY` or `JOIN` across different types

---

## LIMIT and OFFSET – Restricting and Paginating Results


The `LIMIT` clause is used to **restrict the number of rows returned** by a query.

The `OFFSET` clause skips a given number of rows before starting to return results. Together, they are commonly used for **pagination** (e.g., displaying results page by page).

Note: Not all SQL dialects support these clauses natively (e.g., SQL Server uses `TOP` and `OFFSET FETCH`).

### LIMIT only

In [ ]:

-- Return only the first 5 rows
SELECT * FROM Student
LIMIT 5;

### LIMIT with OFFSET

In [ ]:

-- Skip the first 5 rows and return the next 5
SELECT * FROM Student
LIMIT 5 OFFSET 5;

### Pagination Example

In [ ]:

-- Page 1 (rows 0–9)
SELECT * FROM Student
LIMIT 10 OFFSET 0;

-- Page 2 (rows 10–19)
SELECT * FROM Student
LIMIT 10 OFFSET 10;

### SQL Server Equivalent

In [ ]:

-- Use TOP (SQL Server)
SELECT TOP 10 * FROM Student;

-- Use OFFSET FETCH (SQL Server 2012+)
SELECT * FROM Student
ORDER BY student_id
OFFSET 10 ROWS FETCH NEXT 10 ROWS ONLY;

### Notes


- Always use `ORDER BY` when using `LIMIT` or `OFFSET` to ensure consistent row order  
- Be cautious with large OFFSET values — performance may degrade as skipped rows increase  
- For performance-critical pagination, consider using **keyset pagination** with `WHERE` clauses